Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME54_DFP/3.4.70/Microchip.SAME54_DFP.pdsc
      <condition id="ATSAME54P20A">
         <require Dvendor="Microchip:3" Dname="ATSAME54P20A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME54P19A">
         <require Dvendor="Microchip:3" Dname="ATSAME54P19A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME54N20A">
         <require Dvendor="Microchip:3" Dname="ATSAME54N20A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME54N19A">
         <require Dvendor="Microchip:3" Dname="ATSAME54N19A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAME54P20A">
         <description>Headers and startup code for Microchip ATSAME54P20A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same54p20a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same54p20a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same54p20a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same54p20a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_same54p20a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_same54p20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same54p20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same54p20a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same54p20a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same54p20a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAME54P19A">
         <description>Headers and startup code for Microchip ATSAME54P19A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same54p19a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same54p19a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same54p19a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same54p19a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_same54p19a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_same54p19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same54p19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same54p19a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same54p19a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same54p19a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAME54N20A">
         <description>Headers and startup code for Microchip ATSAME54N20A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same54n20a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same54n20a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same54n20a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same54n20a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_same54n20a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_same54n20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same54n20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same54n20a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same54n20a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same54n20a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAME54N19A">
         <description>Headers and startup code for Microchip ATSAME54N19A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same54n19a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same54n19a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same54n19a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same54n19a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_same54n19a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_same54n19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same54n19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same54n19a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same54n19a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same54n19a_sram.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
